// Диапазоны.cpp : Этот файл содержит функцию "main". Здесь начинается и заканчивается выполнение программы.
//

#include <iostream>
#include <Windows.h>

using namespace std;
void main()
{
    setlocale(0, "");
    int a, b;
    cout << "Введите первую границу диапазона чисел" << endl;
    cin >> a;
    cout << "Введите вторую границу диапазона чисел" << endl;
    cin >> b;
    if (a > b)
    {
        int x = a;
        a = b;
        b = x;
    }
    
    cout << "\nВсе числа в указаном диапазоне" << endl;
    for (int i = a; i < b; i++)
        cout << i << " ";
    
    cout << "\nВсе четные числа в указаном диапазоне" << endl;
    for (int i = a; i < b; i++)
        if (i % 2 == 0)
            cout << i << " ";

    cout << "\nВсе нечетные числа в указаном диапазоне" << endl;
    for (int i = a; i < b; i++)
        if (i % 2 != 0)
            cout << i << " ";

    cout << "\nЧисла которые делятся на 7" << endl;
    for (int i = a; i < b; i++)
        if (i % 7 == 0)
            cout << i << " ";

}

// Запуск программы: CTRL+F5 или меню "Отладка" > "Запуск без отладки"
// Отладка программы: F5 или меню "Отладка" > "Запустить отладку"

// Советы по началу работы 
//   1. В окне обозревателя решений можно добавлять файлы и управлять ими.
//   2. В окне Team Explorer можно подключиться к системе управления версиями.
//   3. В окне "Выходные данные" можно просматривать выходные данные сборки и другие сообщения.
//   4. В окне "Список ошибок" можно просматривать ошибки.
//   5. Последовательно выберите пункты меню "Проект" > "Добавить новый элемент", чтобы создать файлы кода, или "Проект" > "Добавить существующий элемент", чтобы добавить в проект существующие файлы кода.
//   6. Чтобы снова открыть этот проект позже, выберите пункты меню "Файл" > "Открыть" > "Проект" и выберите SLN-файл.
